import greenMile from '../image/greenMile.jpg';
import schindlerList from '../image/schindlerList.jpg';
import forrestGump from '../image/forrestGump.jpg';
import theShawahankRedemption from '../image/theShawahankRedemption.jpg';

const movieСards = [
  {
    name: 'greenMile',
    title: 'Зеленая миля',
    passport: 'The Green Mile, 1999, 189 мин.',
    director: 'США. драмма Режиссер: Френк Дорабонт',
    actors: 'В ролях: Том Хэнкс, Дэвид Морс',
    picture: greenMile,
    rating: 9.2,
    descript: `Пол Эджкомб — начальник блока смертников в тюрьме «Холодная гора», каждый из узников которого однажды проходит «зеленую милю» по пути к месту казни. 
      Пол повидал много заключённых и надзирателей за время работы. Однако гигант Джон Коффи, обвинённый в страшном преступлении, стал одним из самых необычных 
      обитателей блока.`,
  },
  {
    name: 'schindlerList',
    title: 'Список Шиндлера',
    passport: 'Schindlers List, 1993, 195 мин.',
    director: 'США. драмма Режиссер: Стивен Спилберг',
    actors: 'В ролях: Лиам Нисон, Бен Кингсли',
    picture: schindlerList,
    rating: 9.1,
    descript: `Фильм рассказывает реальную историю загадочного Оскара Шиндлера, члена нацистской партии, преуспевающего фабриканта, 
      спасшего во время Второй мировой войны почти 1200 евреев.`,
  },
  {
    name: 'forrestGump',
    title: 'Форрест Гамп',
    passport: 'forrestGump, 1994, 142 мин.',
    director: 'США. драмма Режиссер: Роберт Земекис',
    actors: 'В ролях: Том Хэнкс, Робин Райт',
    picture: forrestGump,
    rating: 9.0,
    descript: `Сидя на остановке, Форрест Гамп — не очень умный, но добрый и открытый парень — рассказывает случайным встречным историю своей необыкновенной жизни. 
      С самого малолетства парень страдал от заболевания ног, соседские мальчишки дразнили его, но в один прекрасный день Форрест открыл в себе невероятные 
      способности к бегу. Подруга детства Дженни всегда его поддерживала и защищала, но вскоре дороги их разошлись.`,
  },
  {
    name: 'theShawahankRedemption',
    title: 'Побег из Шоушенка',
    passport: 'The Shawahank Redemption, 1994, 142 мин.',
    director: 'США. драмма Режиссер: Фрэнк Дарабонт',
    actors: 'В ролях: Тим Роббинс, Морган Фирман',
    picture: theShawahankRedemption,
    rating: 9.1,
    descript: `Бухгалтер Энди Дюфрейн обвинён в убийстве собственной жены и её любовника. Оказавшись в тюрьме под названием Шоушенк, 
      он сталкивается с жестокостью и беззаконием, царящими по обе стороны решётки. Каждый, кто попадает в эти стены, становится их рабом до конца жизни. 
      Но Энди, обладающий живым умом и доброй душой, находит подход как к заключённым, так и к охранникам, добиваясь их особого к себе расположения.`,
  },
];

export default movieСards;
